#차원 리스트를 만들고 요소에 접근하기
a = [[10,20],[30,40],[50,60]]
print(a)

#차원 리스트의 요소에 접근하기
print(a[0][0])
print(a[1][1])
print(a[2][1])
a[0][1] = 1000
print(a[0][1])

#톱니형 리스트
a = [[10,20],
     [500,600,700],
     [9],
     [30,40],
     [8],
     [800,900,1000]]
print(a)

a = []
a.append([])
a[0].append(10)
a[0].append(20)
a.append([])
a[1].append(500)
a[1].append(600)
a[1].append(700)
print(a)

#2차원 튜플
a = ((10,20),(30,40),(50,60))
b = ([10,20],[30,40],[50,60])
c = [(10,20),(30,40),(50,60)]
print(a, b, c, sep="/")

#사람이 알아보기 쉽게 출력하기
a = [[10, 20], [30, 40], [50, 60]]
print(a)

from pprint import pprint
pprint(a, indent=4, width=20)
